# GetFailingElements Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailureMessage..::..GetFailingElements Method
FailureMessage Class See Also
---
Retrieves list of the elements that have caused the failure.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ICollection<ElementId> GetFailingElements()
```

Visual Basic
---
```text
Public Function GetFailingElements As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetFailingElements()
```

# ### Return Value
The elements that have caused the failure.
# See Also
FailureMessage Class
Autodesk.Revit.DB Namespace